# questions/answers mapping:
full_answers_orash = list(
  'Προέλευση' = list('1' = 'Πάτρα',
                     '2' = 'Βόλος',
                     '3' = 'Λίστα orasi',
                     '4' = 'Ναύπλιο',
                     '5' = 'Πάτρα',
                     '6' = 'ΚΑΠΗ Αγιάς',
                     '7' = 'ΚΑΠΗ Ψάχου',
                     '8' = 'ΚΑΠΗ Προσφυγικά',
                     '9' = 'Οίκος ευγηρίας Αίγιο',
                     '10'= 'Οίκος ευγηρίας Πάτρα'
  ),
  'Ερώτηση.1' = list('1' = 'Άνδρας', '2' = 'Γυναίκα'),
  'Ερώτηση.3' = list('1' = 'Άγαμος/η',
                     '2' = 'Έγγαμος/η',
                     '3' = 'Διαζευγμένος/η',
                     '4' = 'Χήρος/α',
                     '5' = 'Σε διάσταση',
                     '6' = 'Σε συμβίωση',
                     '7' = 'Άλλο'
  ),
  'Ερώτηση.4' = list('1' = 'Κανένα',
                     '2' = '1',
                     '3' = '2',
                     '4' = '3',
                     '5' = 'περισσότερα από 3'
  ),
  'Ερώτηση.5' = list('1' = 'τυφλός/ή',
                     '2' = 'άτομο με μερική/μειωμένη όραση'
  ),
  'Ερώτηση.7' = list('1' = 'Δεν πήγα σχολείο',
                     '2' = 'Απόφοιτος Δημοτικού',
                     '3' = 'Απόφοιτος Γυμνασίου',
                     '4' = 'Απόφοιτος Λυκείου ή εξατάξιου Γυμνασίου',
                     '5' = 'Απόφοιτος ΙΕΚ/Τεχνικής Σχολής',
                     '6' = 'Απόφοιτος ΤΕΙ',
                     '7' = 'Απόφοιτος ΑΕΙ',
                     '8' = 'Κάτοχος Μεταπτυχιακού Τίτλου Σπουδών',
                     '9' = 'Κάτοχος Διδακτορικού Τίτλου Σπουδών',
                     '10' = 'Άλλο'
  ),
  'Ερώτηση.8' = list('1' = 'Ναι',
                     '2' = 'Όχι'
  ),
  'Ερώτηση.9' = list('1' = 'Αγγλικό',
                     '2' = 'Γερμανικό',
                     '3' = 'Ιταλικό',
                     '4' = 'Γαλλικό',
                     '5' = 'Άλλον',
                     '100' = 'Κανέναν'
  ),
  'Ερώτηση.10'= list('options' = list('1' = 'Αγγλική',
                                      '2' = 'Γερμανική',
                                      '3' = 'Ιταλική',
                                      '4' = 'Γαλλική',
                                      '5' = 'Άλλη 1',
                                      '6' = 'Άλλη 2'
                                      ),
                     'levels' = list('1' = 'Καθόλου',
                                     '2' = 'Βασική Γνώση',
                                     '3' = 'Μέτρια',
                                     '4' = 'Καλά',
                                     '5' = 'Άριστα'
                                     )
  ),
  'Ερώτηση.11'= list('1' = 'Ναι',
                     '2' = 'Όχι'
  ),
  'Ερώτηση.12'= list('1' = 'Άριστα',
                     '2' = 'Καλά',
                     '3' = 'Μέτρια',
                     '4' = 'Βασική Γνώση',
                     '5' = 'Καθόλου'
  ),
  'Ερώτηση.13'= list('1' = 'Ναι',
                     '2' = 'Όχι'
  ),
  'Ερώτηση.14'= list('1' = 'Δημόσιος Υπάλληλος',
                     '2' = 'Ιδιωτικός Υπάλληλος',
                     '3' = 'Ελεύθερος Επαγγελματίας – Αυτοαπασχολούμενος',
                     '4' = 'Επιχειρηματίας',
                     '5' = 'Εισοδηματίας',
                     '6' = 'Άλλο'
  ),
  'Ερώτηση.15'= list('1' = 'Πλήρης απασχόληση',
                     '2' = 'Μερική απασχόληση',
                     '3' = 'Περιστασιακή'
  ),
  'Ερώτηση.16'= list('1' = 'Συνταξιούχος',
                     '2' = 'Άνεργος',
                     '3' = 'Οικιακά',
                     '4' = 'Άλλο'
  ),
  'Ερώτηση.17'= list('1' = 'Καλή',
                     '2' = 'Μέτρια',
                     '3' = 'Κακή'
  ),
  'Ερώτηση.18'= list('1' = 'Ναι',
                     '2' = 'Όχι'
  ),
  'Ερώτηση.19'= list('options' = list('1' = 'Πρόγραμμα 1',
                                      '2' = 'Πρόγραμμα 2',
                                      '3' = 'Πρόγραμμα 3'
                                  ),
                      'levels' = list('1' = 'Καθόλου',
                                      '2' = 'Λίγο',
                                      '3' = 'Αρκετά',
                                      '4' = 'Πολύ',
                                      '5' = 'Απόλυτα'
                      )
  ),
  'Ερώτηση.20'= list('1' = 'Απόκτηση και ανανέωση γνώσεων και δεξιοτήτων',
                     '2' = 'Επαγγελματική Επιμόρφωση (απόκτηση επιπλέον προσόντων)',
                     '3' = 'Προσωπικό ενδιαφέρον (μου αρέσει να μαθαίνω νέα πράγματα)',
                     '4' = 'Οικονομικό κίνητρο (επιδοτούμενο πρόγραμμα)',
                     '5' = 'Κοινωνικοί λόγοι (νέες γνωριμίες – επαφές – συναναστροφές)',
                     '6' = 'Ψυχαγωγία (κάνω κάτι που με χαλαρώνει και μου αρέσει)',
                     '7' = 'Τόνωση αυτοπεποίθησης',
                     '8' = 'Απόδραση από την καθημερινότητα',
                     '9' = 'Άλλο κίνητρο'
  ),
  'Ερώτηση.21'= list('1' = 'Πάρα πολύ',
                     '2' = 'Πολύ',
                     '3' = 'Αρκετά',
                     '4' = 'Λίγο',
                     '5' = 'Καθόλου'
  ),
  'Ερώτηση.22'= list('1' = 'Πρόνοια και Υγεία',
                     '2' = 'Οικονομία και Διοίκηση',
                     '3' = 'Νέες Τεχνολογίες – Πληροφορική',
                     '4' = 'Περιβάλλον',
                     '5' = 'Ξένες Γλώσσες',
                     '6' = 'Ψυχολογία',
                     '7' = 'Πολιτισμός και Τέχνη',
                     '8' = 'Τουρισμός',
                     '9' = 'Άλλο'
  ),
  'Ερώτηση.23'= list('1' = 'Μουσικής – Εκμάθησης Μουσικών Οργάνων',
                     '2' = 'Κίνησης – Ευεξίας – Άθλησης',
                     '3' = 'Κινητικότητας και Προσανατολισμού',
                     '4' = 'Κεραμικής – Γλυπτικής',
                     '5' = 'Μαγειρικής – Ζαχαροπλαστικής',
                     '6' = 'Πληροφορικής – Εξοικείωσης με τις Νέες Τεχνολογίες',
                     '7' = 'Φιλοσοφικών – Θρησκευτικών δραστηριοτήτων',
                     '8' = 'Φιλαναγνωσίας',
                     '9' = 'Θεάτρου',
                     '10' = 'Δημιουργικής Γραφής',
                     '11' = 'Παιχνιδιών (Επιτραπέζια/Κουίζ/Ηλεκτρονικών παιχνιδιών)',
                     '12' = 'Υγιεινής Διατροφής',
                     '13' = 'Λαϊκής Παράδοσης και Τέχνης',
                     '14' = 'Ασκήσεων Μνήμης και Προσοχής',
                     '15' = 'Περιπάτου, Επίσκεψης Μουσείων και Αρχαιολογικών χώρων',
                     '16' = 'Διαχείρισης Ελεύθερου Χρόνου',
                     '17' = 'Πλεξίματος',
                     '18' = 'Δημιουργία Κοσμημάτων',
                     '19' = 'Καλαθοπλεκτικής',
                     '20' = 'Κομποδετικής',
                     '21' = 'Πρόληψης Ατυχημάτων',
                     '22' = 'Αυτοάμυνας',
                     '23' = 'Κυκλοφοριακής Αγωγής',
                     '24' = 'Διαχείρισης Άγχους',
                     '25' = 'Πρώτων Βοηθειών',
                     '26' = 'Οινολογίας – Οινογνωσίας',
                     '27' = 'Εκμάθησης συστήματος Braille',
                     '28' = 'Εκμάθησης συστήματος Nemeth',
                     '29' = 'Άλλη εκπαιδευτική δραστηριότητα'
  ),
  'Ερώτηση.24'= list('1' = 'Απόκτηση και ανανέωση γνώσεων και δεξιοτήτων',
                     '2' = 'Επαγγελματική Επιμόρφωση (απόκτηση επιπλέον προσόντων)',
                     '3' = 'Προσωπικό ενδιαφέρον (μου αρέσει να μαθαίνω νέα πράγματα)',
                     '4' = 'Οικονομικό κίνητρο (επιδοτούμενο πρόγραμμα)',
                     '5' = 'Κοινωνικοί λόγοι (νέες γνωριμίες – επαφές – συναναστροφές)',
                     '6' = 'Ψυχαγωγία (κάνω κάτι που με χαλαρώνει και μου αρέσει)',
                     '7' = 'Τόνωση αυτοπεποίθησης',
                     '8' = 'Απόδραση από την καθημερινότητα',
                     '9' = 'Άλλο κίνητρο'
  ),
  'Ερώτηση.25'= list('1' = 'Έλλειψη πληροφόρησης/ενημέρωσης',
                     '2' = 'Οικονομικοί λόγοι (κόστος συμμετοχής)',
                     '3' = 'Περιορισμένος ελεύθερος χρόνος',
                     '4' = 'Αδυναμία μετακίνησης στον τόπο διεξαγωγής',
                     '5' = 'Κακή ποιότητα των εκπαιδευτικών προγραμμάτων',
                     '6' = 'Μη βολικό ωράριο',
                     '7' = 'Απουσία ατομικής πρωτοβουλίας – αναβλητικότητα',
                     '8' = 'Ανυπαρξία προγραμμάτων προσαρμοσμένων στις ανάγκες μας',
                     '9' = 'Άλλο',
                     '10' = 'Δε θεωρώ πως υπάρχουν εμπόδια'
  ),
  'Ερώτηση.26'= list('1' = 'λιγότερο από ένα μήνα',
                     '2' = '1 μήνα',
                     '3' = '2-3 μήνες',
                     '4' = '4-6 μήνες',
                     '5' = 'περισσότερο από 6 μήνες',
                     '6' = 'δε με ενοχλεί η διάρκεια'
  ),
  'Ερώτηση.27'= list('1' = '1-2',
                     '2' = '3-4',
                     '3' = '5-6',
                     '4' = '7-8',
                     '5' = 'περισσότερες από 8 ώρες'
  ),
  'Ερώτηση.28'= list('1' = 'Χειμώνας',
                     '2' = 'Άνοιξη',
                     '3' = 'Καλοκαίρι',
                     '4' = 'Φθινόπωρο',
                     '5' = 'Δε με πειράζει'
  ),
  'Ερώτηση.29'= list('1' = 'Μόνο Θεωρία, Καθόλου Πρακτική Εξάσκηση',
                     '2' = 'Πολλή Θεωρία, Λίγη Πρακτική Εξάσκηση',
                     '3' = 'Θεωρία και Πρακτική Εξάσκηση εξίσου',
                     '4' = 'Λίγη Θεωρία, Πολύ Πρακτική Εξάσκηση',
                     '5' = 'Καθόλου Θεωρία, Μόνο Πρακτική Εξάσκηση'
  ),
  'Ερώτηση.30'= list('1' = 'Εξ αποστάσεως',
                     '2' = 'Διά ζώσης (πρόσωπο με πρόσωπο)',
                     '3' = 'Συνδυασμός των παραπάνω'
  ),
  'Ερώτηση.31'= list('1' = 'Δημόσιους Φορείς',
                     '2' = 'Ιδιωτικούς Εκπαιδευτικούς Φορείς',
                     '3' = 'Το ίδιο'
  ),
  'Ερώτηση.32'= list('1' = 'Να γνωρίζουν καλά το αντικείμενο',
                     '2' = 'Να είναι μεταδοτικοί',
                     '3' = 'Να είναι φιλικοί και επικοινωνιακοί',
                     '4' = 'Να είναι οργανωτικοί',
                     '5' = 'Να είναι αντικειμενικοί',
                     '6' = 'Να κατανοούν τις ανάγκες μας',
                     '7' = 'Να αξιοποιούν τον κατάλληλο τεχνικό εξοπλισμό',
                     '8' = 'Άλλο'
  ),
  'Ερώτηση.33'= list(
    '1' = 'Ναι, θα με ενοχλούσε.',
    '2' = 'Όχι, δε θα είχα πρόβλημα.'
  ),
  'Ερώτηση.34'= list('1' = 'Ναι',
                     '2' = 'Όχι'
  )
)

full_answers_3hlikia <- full_answers_orash
full_answers_3hlikia[['Ερώτηση.5']] <- full_answers_orash[['Ερώτηση.7']]
full_answers_3hlikia[['Ερώτηση.6']] <- full_answers_orash[['Ερώτηση.10']]
full_answers_3hlikia[['Ερώτηση.7']] <- full_answers_orash[['Ερώτηση.12']]
full_answers_3hlikia[['Ερώτηση.8']] <- full_answers_orash[['Ερώτηση.13']]
full_answers_3hlikia[['Ερώτηση.9']] <- list(
  '1' = 'Δημόσιος Υπάλληλος',
  '2' = 'Ιδιωτικός Υπάλληλος',
  '3' = 'Ελεύθερος Επαγγελματίας – Αυτοαπασχολούμενος',
  '4' = 'Επιχειρηματίας',
  '5' = 'Εισοδηματίας',
  '6' = 'Αγρότης',
  '7' = 'Άλλο'
)
full_answers_3hlikia[['Ερώτηση.10']] <- full_answers_orash[['Ερώτηση.15']]
full_answers_3hlikia[['Ερώτηση.11']] <- full_answers_orash[['Ερώτηση.16']]
full_answers_3hlikia[['Ερώτηση.12']] <- full_answers_orash[['Ερώτηση.17']]
full_answers_3hlikia[['Ερώτηση.13']] <- full_answers_orash[['Ερώτηση.18']]
full_answers_3hlikia[['Ερώτηση.14']] <- full_answers_orash[['Ερώτηση.19']]
full_answers_3hlikia[['Ερώτηση.15']] <- full_answers_orash[['Ερώτηση.20']]
full_answers_3hlikia[['Ερώτηση.16']] <- full_answers_orash[['Ερώτηση.21']]
full_answers_3hlikia[['Ερώτηση.17']] <- full_answers_orash[['Ερώτηση.22']]
full_answers_3hlikia[['Ερώτηση.18']] <- list(
  '1' = 'Μουσικής – Εκμάθησης Μουσικών Οργάνων',
  '2' = 'Χορού',
  '3' = 'Κίνησης – Ευεξίας – Άθλησης',
  '4' = 'Δημιουργικής Έκφρασης (χειροτεχνία)',
  '5' = 'Ζωγραφικής',
  '6' = 'Κεραμικής – Γλυπτικής',
  '7' = 'Μαγειρικής – Ζαχαροπλαστικής',
  '8' = 'Φωτογραφίας',
  '9' = 'Κηπουρικής',
  '10' = 'Πληροφορικής – Εξοικείωσης με τις Νέες Τεχνολογίες',
  '11' = 'Φιλοσοφικών – Θρησκευτικών δραστηριοτήτων',
  '12' = 'Φιλαναγνωσίας',
  '13' = 'Δημιουργικής Γραφής',
  '14' = 'Παιχνιδιών (Επιτραπέζια/Σταυρόλεξα/Κουίζ/Ηλεκτρονικών παιχνιδιών)',
  '15' = 'Υγιεινής Διατροφής',
  '16' = 'Λαϊκής Παράδοσης και Τέχνης',
  '17' = 'Ασκήσεων Μνήμης και Προσοχής',
  '18' = 'Περιπάτου, Επίσκεψης Μουσείων και Αρχαιολογικών χώρων.',
  '19' = 'Διαχείρισης Ελεύθερου Χρόνου',
  '20' = 'Εθελοντικών Δράσεων',
  '21' = 'Ασφαλούς Οδήγησης',
  '22' = 'Θεάτρου – Κινηματογράφου',
  '23' = 'Πλεξίματος',
  '24' = 'Καλαθοπλεκτικής',
  '25' = 'Δημιουργία Κοσμημάτων',
  '26' = 'Κομποδετικής',
  '27' = 'Πρόληψης Ατυχημάτων',
  '28' = 'Αυτοάμυνας',
  '29' = 'Κυκλοφοριακής Αγωγής',
  '30' = 'Διαχείρισης Άγχους',
  '31' = 'Πρώτων Βοηθειών',
  '32' = 'Οινολογίας – Οινογνωσίας',
  '33' = 'Άλλη εκπαιδευτική δραστηριότητα'
)
full_answers_3hlikia[['Ερώτηση.19']] <- full_answers_orash[['Ερώτηση.24']]
full_answers_3hlikia[['Ερώτηση.20']] <- full_answers_orash[['Ερώτηση.25']]
full_answers_3hlikia[['Ερώτηση.21']] <- full_answers_orash[['Ερώτηση.26']]
full_answers_3hlikia[['Ερώτηση.22']] <- full_answers_orash[['Ερώτηση.27']]
full_answers_3hlikia[['Ερώτηση.23']] <- full_answers_orash[['Ερώτηση.28']]
full_answers_3hlikia[['Ερώτηση.24']] <- full_answers_orash[['Ερώτηση.29']]
full_answers_3hlikia[['Ερώτηση.25']] <- full_answers_orash[['Ερώτηση.30']]
full_answers_3hlikia[['Ερώτηση.26']] <- full_answers_orash[['Ερώτηση.31']]
full_answers_3hlikia[['Ερώτηση.27']] <- full_answers_orash[['Ερώτηση.32']]
full_answers_3hlikia[['Ερώτηση.28']] <- list(
  '1' = 'Στο χώρο σας',
  '2' = 'Σε άλλο χώρο',
  '3' = 'Δε με πειράζει'
)
full_answers_3hlikia[['Ερώτηση.29']] <- full_answers_orash[['Ερώτηση.33']]
full_answers_3hlikia[['Ερώτηση.30']] <- full_answers_orash[['Ερώτηση.34']]

full_answers_akoh <- full_answers_orash
full_answers_akoh[['Ερώτηση.5']] <- list(
  '1' = 'Κωφός/ή',
  '2' = 'Βαρήκοος/η'
)
full_answers_akoh[['Ερώτηση.7']] <- list(
  '1' = 'Κωφή',
  '2' = 'Βαρήκοοη',
  '3' = 'Ακούουσα'
)
full_answers_akoh[['Ερώτηση.8']] <- list(
  '1' = 'Κωφός',
  '2' = 'Βαρήκοος',
  '3' = 'Ακούων'
)
full_answers_akoh[['Ερώτηση.9']]<- full_answers_orash[['Ερώτηση.8']]
full_answers_akoh[['Ερώτηση.10']] <- full_answers_orash[['Ερώτηση.8']]
full_answers_akoh[['Ερώτηση.11']] <- full_answers_orash[['Ερώτηση.7']]
full_answers_akoh[['Ερώτηση.12']] <- full_answers_orash[['Ερώτηση.8']]
full_answers_akoh[['Ερώτηση.13']] <- full_answers_orash[['Ερώτηση.10']]
full_answers_akoh[['Ερώτηση.14']] <- full_answers_orash[['Ερώτηση.8']]
full_answers_akoh[['Ερώτηση.15']] <- full_answers_orash[['Ερώτηση.10']]
full_answers_akoh[['Ερώτηση.16']] <- full_answers_orash[['Ερώτηση.8']]
full_answers_akoh[['Ερώτηση.17']] <- full_answers_orash[['Ερώτηση.12']]
full_answers_akoh[['Ερώτηση.18']] <- full_answers_orash[['Ερώτηση.8']]
full_answers_akoh[['Ερώτηση.19']] <- full_answers_3hlikia[['Ερώτηση.9']]
full_answers_akoh[['Ερώτηση.20']] <- full_answers_orash[['Ερώτηση.15']]
full_answers_akoh[['Ερώτηση.21']] <- full_answers_orash[['Ερώτηση.16']]
full_answers_akoh[['Ερώτηση.22']] <- full_answers_orash[['Ερώτηση.17']]
full_answers_akoh[['Ερώτηση.23']] <- full_answers_orash[['Ερώτηση.8']]
full_answers_akoh[['Ερώτηση.24']] <- full_answers_orash[['Ερώτηση.19']]
full_answers_akoh[['Ερώτηση.25']] <- full_answers_orash[['Ερώτηση.20']]
full_answers_akoh[['Ερώτηση.26']] <- full_answers_orash[['Ερώτηση.21']]
full_answers_akoh[['Ερώτηση.27']] <- full_answers_orash[['Ερώτηση.22']]
full_answers_akoh[['Ερώτηση.28']] <- list(
  '1' = 'Κίνησης – Ευεξίας – Άθλησης',
  '2' = 'Δημιουργικής Έκφρασης (χειροτεχνία)',
  '3' = 'Ζωγραφικής',
  '4' = 'Κεραμικής – Γλυπτικής',
  '5' = 'Μαγειρικής – Ζαχαροπλαστικής',
  '6' = 'Φωτογραφίας',
  '7' = 'Κηπουρικής',
  '8' = 'Πληροφορικής – Εξοικείωσης με τις Νέες Τεχνολογίες',
  '9' = 'Φιλοσοφικών – Θρησκευτικών δραστηριοτήτων',
  '10' = 'Φιλαναγνωσίας',
  '11' = 'Δημιουργικής Γραφής',
  '12' = 'Παιχνιδιών (Επιτραπέζια/Σταυρόλεξα/Κουίζ/Ηλεκτρονικών παιχνιδιών)',
  '13' = 'Υγιεινής Διατροφής',
  '14' = 'Λαϊκής Παράδοσης και Τέχνης',
  '15' = 'Ασκήσεων Μνήμης και Προσοχής',
  '16' = 'Περιπάτου, Επίσκεψης Μουσείων και Αρχαιολογικών χώρων.',
  '17' = 'Διαχείρισης Ελεύθερου Χρόνου',
  '18' = 'Εθελοντικών Δράσεων',
  '19' = 'Ασφαλούς Οδήγησης',
  '20' = 'Θεάτρου – Κινηματογράφου',
  '21' = 'Πλεξίματος',
  '22' = 'Δημιουργία Κοσμημάτων',
  '23' = 'Καλαθοπλεκτικής',
  '24' = 'Κομποδετικής',
  '25' = 'Πρόληψης Ατυχημάτων',
  '26' = 'Αυτοάμυνας',
  '27' = 'Κυκλοφοριακής Αγωγής',
  '28' = 'Διαχείρισης Άγχους',
  '29' = 'Πρώτων Βοηθειών',
  '30' = 'Οινολογίας – Οινογνωσίας',
  '31' = 'Εκμάθησης Ελληνικής Νοηματικής Γλώσσας',
  '32' = 'Εκμάθησης Ξένης Νοηματικής Γλώσσας',
  '33' = 'Άλλη εκπαιδευτική δραστηριότητα'
)
full_answers_akoh[['Ερώτηση.29']] <- full_answers_orash[['Ερώτηση.24']]
full_answers_akoh[['Ερώτηση.30']] <- full_answers_orash[['Ερώτηση.25']]
full_answers_akoh[['Ερώτηση.31']] <- full_answers_orash[['Ερώτηση.26']]
full_answers_akoh[['Ερώτηση.32']] <- full_answers_orash[['Ερώτηση.27']]
full_answers_akoh[['Ερώτηση.33']] <- full_answers_orash[['Ερώτηση.28']]
full_answers_akoh[['Ερώτηση.34']] <- full_answers_orash[['Ερώτηση.29']]
full_answers_akoh[['Ερώτηση.35']] <- full_answers_orash[['Ερώτηση.30']]
full_answers_akoh[['Ερώτηση.36']] <- list(
  '1' = 'Ελληνική Νοηματική Γλώσσα',
  '2' = 'Ελληνική ομιλούμενη γλώσσα',
  '3' = 'Και στις δύο',
  '4' = 'Δε με πειράζει'
)
full_answers_akoh[['Ερώτηση.37']] <- full_answers_orash[['Ερώτηση.31']]
full_answers_akoh[['Ερώτηση.38']] <- full_answers_orash[['Ερώτηση.32']]
full_answers_akoh[['Ερώτηση.39']] <- full_answers_orash[['Ερώτηση.33']]
full_answers_akoh[['Ερώτηση.40']] <- full_answers_orash[['Ερώτηση.34']]

full_questions_3hlikia = list(
  'Προέλευση' = 'Προέλευση στοιχείων έρευνας',
  'Ερώτηση.1' = 'Φύλο',
  'Ερώτηση.2' = 'Ηλικία',
  'Ερώτηση.3' = 'Οικογενειακή κατάσταση',
  'Ερώτηση.4' = 'Πόσα παιδιά έχετε;',
  'Ερώτηση.5' = 'Ανώτατο επίπεδο σπουδών τυπικής εκπαίδευσης',
  'Ερώτηση.6' = 'Γνώση Ξένων Γλωσσών',
  'Ερώτηση.7' = 'Γνώση Η/Υ',
  'Ερώτηση.8' = 'Εργάζεστε;',
  'Ερώτηση.9' = 'Αν εργάζεστε: Ποιο είναι το επάγγελμά σας;',
  'Ερώτηση.10' = 'Αν εργάζεστε: Ποιο είναι το είδος της απασχόλησης:',
  'Ερώτηση.11' = 'Αν ΔΕΝ εργάζεστε: Ποια είναι η κατάστασή σας;',
  'Ερώτηση.12' = 'Πώς θα χαρακτηρίζατε την οικονομική σας κατάσταση;',
  'Ερώτηση.13' = 'Έχετε συμμετάσχει στο παρελθόν σε κάποιο πρόγραμμα Εκπαίδευσης Ενηλίκων;',
  'Ερώτηση.14' = 'Συμμετοχές σε προγράμματα εκπαίδευσης ενηλίκων',
  'Ερώτηση.15' = 'Για ποιους λόγους παρακολουθήσατε τα προγράμματα/σεμινάρια;',
  'Ερώτηση.16' = 'Πόσο απαραίτητη θεωρείτε τη συμμετοχή σας σε ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.17' = 'Σε ποιους τομείς θα επιθυμούσατε να εκπαιδευτείτε/επιμορφωθείτε;',
  'Ερώτηση.18' = 'Σε ποια οργανωμένα εκπαιδευτικά προγράμματα ομαδικών δραστηριοτήτων θα συμμετείχατε;',
  'Ερώτηση.19' = 'Ποια είναι τα σημαντικότερα κίνητρα για να συμμετάσχετε σε ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.20' = 'Ποιοι είναι οι σημαντικότεροι παράγοντες που εμποδίζουν τη συμμετοχή σας σε ένα εκπαιδευτικό πρόγραμμα/ομαδική δραστηριότητα;',
  'Ερώτηση.21' = 'Πόση διάρκεια θα θέλατε να έχει ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.22' = 'Πόσες ώρες την εβδομάδα θα διαθέτατε για τη παρακολούθηση ενός εκπαιδευτικού προγράμματος;',
  'Ερώτηση.23' = 'Ποια/ες θεωρείτε πως είναι η/οι ιδανικότερη/ες χρονική/ές περίοδος/οι υλοποίησης ενός εκπαιδευτικού προγράμματος;',
  'Ερώτηση.24' = 'Πόση Θεωρία και Πόση Πρακτική Εξάσκηση θεωρείτε πως πρέπει να έχει ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.25' = 'Ποιος θα επιθυμούσατε να είναι ο τρόπος διδασκαλίας;',
  'Ερώτηση.26' = 'Ποιον φορέα θεωρείτε πιο κατάλληλο για το σχεδιασμό και την υλοποίηση προγραμμάτων εκπαίδευσης ενηλίκων ή επιμορφωτικών σεμιναρίων;',
  'Ερώτηση.27' = 'Ποια είναι τα σημαντικότερα χαρακτηριστικά που θα θέλατε να έχουν οι εκπαιδευτές σας;',
  'Ερώτηση.28' = 'Που θα επιθυμούσατε να λάβει χώρα το εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.29' = 'Θα σας ενοχλούσε αν στο πρόγραμμα συμμετείχαν μαζί με εσάς και εκπαιδευόμενοι νεότερων ηλικιακών ομάδων;',
  'Ερώτηση.30' = 'Αν προσφερόταν η δυνατότητα, θα θέλατε να αναλάβετε τον ρόλο του εκπαιδευτή σε ένα πρόγραμμα σχετικό με τις γνώσεις και δεξιότητές σας;'
)
full_questions_orash = list(
  'Προέλευση' = 'Προέλευση στοιχείων έρευνας',
  'Ερώτηση.1' = 'Φύλο',
  'Ερώτηση.2' = 'Ηλικία',
  'Ερώτηση.3' = 'Οικογενειακή κατάσταση',
  'Ερώτηση.4' = 'Πόσα παιδιά έχετε;',
  'Ερώτηση.5' = 'Είσαστε',
  'Ερώτηση.6' = 'Σε ποιά ηλικία παρουσιάστηκε το πρόβλημα στην όρασή σας;',
  'Ερώτηση.7' = 'Ανώτατο επίπεδο σπουδών τυπικής εκπαίδευσης',
  'Ερώτηση.8' = 'Γνώση συστήματος Braille;',
  'Ερώτηση.9' = 'Εκτός από τον ελληνικό κώδικα Braille, ποιους άλλους γνωρίζετε;',
  'Ερώτηση.10' = 'Γνώση Ξένων Γλωσσών',
  'Ερώτηση.11' = 'Γνώση συστήματος Nemeth;',
  'Ερώτηση.12' = 'Γνώση Η/Υ',
  'Ερώτηση.13' = 'Εργάζεστε;',
  'Ερώτηση.14' = 'Αν εργάζεστε: Ποιο είναι το επάγγελμά σας;',
  'Ερώτηση.15' = 'Αν εργάζεστε: Ποιο είναι το είδος της απασχόλησης:',
  'Ερώτηση.16' = 'Αν ΔΕΝ εργάζεστε: Ποια είναι η κατάστασή σας;',
  'Ερώτηση.17' = 'Πώς θα χαρακτηρίζατε την οικονομική σας κατάσταση;',
  'Ερώτηση.18' = 'Έχετε συμμετάσχει στο παρελθόν σε κάποιο πρόγραμμα Εκπαίδευσης Ενηλίκων;',
  'Ερώτηση.19' = 'Συμμετοχές σε προγράμματα εκπαίδευσης ενηλίκων',
  'Ερώτηση.20' = 'Για ποιους λόγους παρακολουθήσατε τα προγράμματα/σεμινάρια;',
  'Ερώτηση.21' = 'Πόσο απαραίτητη θεωρείτε τη συμμετοχή σας σε ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.22' = 'Σε ποιους τομείς θα επιθυμούσατε να εκπαιδευτείτε/επιμορφωθείτε;',
  'Ερώτηση.23' = 'Σε ποια οργανωμένα εκπαιδευτικά προγράμματα ομαδικών δραστηριοτήτων θα συμμετείχατε;',
  'Ερώτηση.24' = 'Ποια είναι τα σημαντικότερα κίνητρα για να συμμετάσχετε σε ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.25' = 'Ποιοι είναι οι σημαντικότεροι παράγοντες που εμποδίζουν τη συμμετοχή σας σε ένα εκπαιδευτικό πρόγραμμα/ομαδική δραστηριότητα;',
  'Ερώτηση.26' = 'Πόση διάρκεια θα θέλατε να έχει ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.27' = 'Πόσες ώρες την εβδομάδα θα διαθέτατε για τη παρακολούθηση ενός εκπαιδευτικού προγράμματος;',
  'Ερώτηση.28' = 'Ποια/ες θεωρείτε πως είναι η/οι ιδανικότερη/ες χρονική/ές περίοδος/οι υλοποίησης ενός εκπαιδευτικού προγράμματος;',
  'Ερώτηση.29' = 'Πόση Θεωρία και Πόση Πρακτική Εξάσκηση θεωρείτε πως πρέπει να έχει ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.30' = 'Ποιος θα επιθυμούσατε να είναι ο τρόπος διδασκαλίας;',
  'Ερώτηση.31' = 'Ποιον φορέα θεωρείτε πιο κατάλληλο για το σχεδιασμό και την υλοποίηση προγραμμάτων εκπαίδευσης ενηλίκων ή επιμορφωτικών σεμιναρίων;',
  'Ερώτηση.32' = 'Ποια χαρακτηριστικά θα θέλατε να έχουν οι εκπαιδευτές σας;',
  'Ερώτηση.33' = 'Θα σας ενοχλούσε αν στο πρόγραμμα συμμετείχαν μαζί με εσάς και εκπαιδευόμενοι χωρίς προβλήματα όρασης;',
  'Ερώτηση.34' = 'Αν προσφερόταν η δυνατότητα, θα θέλατε να αναλάβετε τον ρόλο του εκπαιδευτή σε ένα πρόγραμμα σχετικό με τις γνώσεις και δεξιότητές σας;'
)

full_questions_akoh = list(
  'Προέλευση' = 'Προέλευση στοιχείων έρευνας',
  'Ερώτηση.1' = 'Φύλο',
  'Ερώτηση.2' = 'Ηλικία',
  'Ερώτηση.3' = 'Οικογενειακή κατάσταση',
  'Ερώτηση.4' = 'Πόσα παιδιά έχετε;',
  'Ερώτηση.5' = 'Είσαστε',
  'Ερώτηση.6' = 'Σε ποιά ηλικία παρουσιάστηκε το πρόβλημα στην ακοή σας;',
  'Ερώτηση.7' = 'Η μητέρα σας είναι:',
  'Ερώτηση.8' = 'Ο πατέρας σας είναι:',
  'Ερώτηση.9' = 'Χρησιμοποιείτε ακουστικό βοήθημα;',
  'Ερώτηση.10' = 'Έχετε κοχλιακό εμφύτευμα;',
  'Ερώτηση.11' = 'Ανώτατο επίπεδο σπουδών τυπικής εκπαίδευσης',
  'Ερώτηση.12' = 'Γνώση Ελληνικής Νοηματικής Γλώσσας;',
  'Ερώτηση.13' = 'Γνώση Ξένης Νοηματικής Γλώσσας',
  'Ερώτηση.14' = 'Γνώση Ελληνικής ομιλούμενης γλώσσας;',
  'Ερώτηση.15' = 'Γνώση Ξένων ομιλούμενων Γλωσσών',
  'Ερώτηση.16' = 'Έχετε την ικανότητα της χειλανάγνωσης;',
  'Ερώτηση.17' = 'Γνώση Η/Υ',
  'Ερώτηση.18' = 'Εργάζεστε;',
  'Ερώτηση.19' = 'Αν εργάζεστε: Ποιο είναι το επάγγελμά σας;',
  'Ερώτηση.20' = 'Αν εργάζεστε: Ποιο είναι το είδος της απασχόλησης:',
  'Ερώτηση.21' = 'Αν ΔΕΝ εργάζεστε: Ποια είναι η κατάστασή σας;',
  'Ερώτηση.22' = 'Πώς θα χαρακτηρίζατε την οικονομική σας κατάσταση;',
  'Ερώτηση.23' = 'Έχετε συμμετάσχει στο παρελθόν σε κάποιο πρόγραμμα Εκπαίδευσης Ενηλίκων;',
  'Ερώτηση.24' = 'Συμμετοχές σε προγράμματα εκπαίδευσης ενηλίκων',
  'Ερώτηση.25' = 'Για ποιους λόγους παρακολουθήσατε τα προγράμματα/σεμινάρια;',
  'Ερώτηση.26' = 'Πόσο απαραίτητη θεωρείτε τη συμμετοχή σας σε ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.27' = 'Σε ποιους τομείς θα επιθυμούσατε να εκπαιδευτείτε/επιμορφωθείτε;',
  'Ερώτηση.28' = 'Σε ποια οργανωμένα εκπαιδευτικά προγράμματα ομαδικών δραστηριοτήτων θα συμμετείχατε;',
  'Ερώτηση.29' = 'Ποια είναι τα σημαντικότερα κίνητρα για να συμμετάσχετε σε ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.30' = 'Ποιοι είναι οι σημαντικότεροι παράγοντες που εμποδίζουν τη συμμετοχή σας σε ένα εκπαιδευτικό πρόγραμμα/ομαδική δραστηριότητα;',
  'Ερώτηση.31' = 'Πόση διάρκεια θα θέλατε να έχει ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.32' = 'Πόσες ώρες την εβδομάδα θα διαθέτατε για τη παρακολούθηση ενός εκπαιδευτικού προγράμματος;',
  'Ερώτηση.33' = 'Ποια/ες θεωρείτε πως είναι η/οι ιδανικότερη/ες χρονική/ές περίοδος/οι υλοποίησης ενός εκπαιδευτικού προγράμματος;',
  'Ερώτηση.34' = 'Πόση Θεωρία και Πόση Πρακτική Εξάσκηση θεωρείτε πως πρέπει να έχει ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.35' = 'Ποιος θα επιθυμούσατε να είναι ο τρόπος διδασκαλίας;',
  'Ερώτηση.36' = 'Σε ποια γλώσσα θα προτιμούσατε να διεξάγετε ένα εκπαιδευτικό πρόγραμμα;',
  'Ερώτηση.37' = 'Ποιον φορέα θεωρείτε πιο κατάλληλο για το σχεδιασμό και την υλοποίηση προγραμμάτων εκπαίδευσης ενηλίκων ή επιμορφωτικών σεμιναρίων;',
  'Ερώτηση.38' = 'Ποια χαρακτηριστικά θα θέλατε να έχουν οι εκπαιδευτές σας;',
  'Ερώτηση.39' = 'Θα σας ενοχλούσε αν στο πρόγραμμα συμμετείχαν μαζί με εσάς και εκπαιδευόμενοι χωρίς προβλήματα ακοής;',
  'Ερώτηση.40' = 'Αν προσφερόταν η δυνατότητα, θα θέλατε να αναλάβετε τον ρόλο του εκπαιδευτή σε ένα πρόγραμμα σχετικό με τις γνώσεις και δεξιότητές σας;'
)